#### Config

In [1]:
# Définition du nom d fichier
filename <- "nat2020.csv" 
# Chargement du fichier
dataset <- read.csv(filename, header=TRUE)

In [2]:
data <- read.csv("nat2020.csv", sep = ";", stringsAsFactors = FALSE)
head(data,5)

  sexe preusuel       annais nombre
1 1    _PRENOMS_RARES 1900   1250
2 1    _PRENOMS_RARES 1901   1342
3 1    _PRENOMS_RARES 1902   1330
4 1    _PRENOMS_RARES 1903   1286
5 1    _PRENOMS_RARES 1904   1430

In [3]:
#### Changement du nom des colonnes
names(data) <- c("genre", "prénom","année","naissance")
# Affichage des 5 premières lignes
head(data)

  genre prénom         année naissance
1 1     _PRENOMS_RARES 1900  1250
2 1     _PRENOMS_RARES 1901  1342
3 1     _PRENOMS_RARES 1902  1330
4 1     _PRENOMS_RARES 1903  1286
5 1     _PRENOMS_RARES 1904  1430
6 1     _PRENOMS_RARES 1905  1472

In [4]:
tail(data)

       genre prénom année naissance
667359 2     ZYNEB  2016   6
667360 2     ZYNEB  2017   6
667361 2     ZYNEB  2018   5
667362 2     ZYNEB  2019   7
667363 2     ZYNEB  2020   8
667364 2     ZYNEB  XXXX  19

In [5]:
library("dplyr")

Attachement du package : ‘dplyr’


Les objets suivants sont masqués depuis ‘package:stats’:

    filter, lag


Les objets suivants sont masqués depuis ‘package:base’:

    intersect, setdiff, setequal, union

- Type de données

In [6]:
sapply(data, class) #### Type de chaque variable

      genre      prénom       année   naissance
  "integer" "character" "character"   "integer"

- Modification du genre en H et F

In [21]:
data$genre[data$genre ==1] <- "H" #### Tranformation des 1 en H

In [22]:
data$genre[data$genre ==2] <- "F" #### Tranformation des 2 en F

In [9]:
head(data$genre) #Vérification

[1] "H" "H" "H" "H" "H" "H"

In [25]:
library(stringr)
library(tools)
data$prénom <- str_to_title(data$prénom)

In [24]:
str(data)
data$année <- as.numeric(as.character(data$année)) ##### Cas1:  Factor --> Character --> Numérique (Opérateur intermédiaire)

'data.frame':	667364 obs. of  4 variables:
 $ genre    : chr  "H" "H" "H" "H" ...
 $ prénom   : chr  "_Prenoms_rares" "_Prenoms_rares" "_Prenoms_rares" "_Prenoms_rares" ...
 $ année    : num  1900 1901 1902 1903 1904 ...
 $ naissance: int  1250 1342 1330 1286 1430 1472 1451 1514 1509 1526 ...

In [29]:
library("dplyr")
data

       genre prénom         année naissance
1      H     _Prenoms_rares 1900  1250
2      H     _Prenoms_rares 1901  1342
3      H     _Prenoms_rares 1902  1330
4      H     _Prenoms_rares 1903  1286
5      H     _Prenoms_rares 1904  1430
6      H     _Prenoms_rares 1905  1472
7      H     _Prenoms_rares 1906  1451
8      H     _Prenoms_rares 1907  1514
9      H     _Prenoms_rares 1908  1509
10     H     _Prenoms_rares 1909  1526
11     H     _Prenoms_rares 1910  1666
12     H     _Prenoms_rares 1911  1572
13     H     _Prenoms_rares 1912  1608
14     H     _Prenoms_rares 1913  1604
15     H     _Prenoms_rares 1914  1597
16     H     _Prenoms_rares 1915  1208
17     H     _Prenoms_rares 1916  1025
18     H     _Prenoms_rares 1917  1148
19     H     _Prenoms_rares 1918  1157
20     H     _Prenoms_rares 1919  1030
21     H     _Prenoms_rares 1920  1535
22     H     _Prenoms_rares 1921  1617
23     H     _Prenoms_rares 1922  1574
24     H     _Prenoms_rares 1923  1931
25     H     _Prenoms_rares 1924  2475
26     H     _Prenoms_rares 1925  2844
27     H     _Prenoms_rares 1926  2919
28     H     _Prenoms_rares 1927  2711
29     H     _Prenoms_rares 1928  2506
30     H     _Prenoms_rares 1929  2445
⋮      ⋮     ⋮              ⋮     ⋮
667335 F     Zya            2019   9
667336 F     Zya            2020  12
667337 F     Zya              NA   6
667338 F     Zyna           2008   3
667339 F     Zyna           2010   3
667340 F     Zyna           2011   4
667341 F     Zyna           2012   6
667342 F     Zyna           2013   6
667343 F     Zyna           2015   9
667344 F     Zyna           2016   5
667345 F     Zyna           2017   5
667346 F     Zyna           2020   5
667347 F     Zyna             NA  16
667348 F     Zyneb          1999   3
667349 F     Zyneb          2004   4
667350 F     Zyneb          2005   5
667351 F     Zyneb          2006   4
667352 F     Zyneb          2008  11
667353 F     Zyneb          2010   7
667354 F     Zyneb          2011   5
667355 F     Zyneb          2012   8
667356 F     Zyneb          2013   4
667357 F     Zyneb          2014  10
667358 F     Zyneb          2015   7
667359 F     Zyneb          2016   6
667360 F     Zyneb          2017   6
667361 F     Zyneb          2018   5
667362 F     Zyneb          2019   7
667363 F     Zyneb          2020   8
667364 F     Zyneb            NA  19

## Correction question 2: Liste de prénom mixte

**Prenom mixte**: Prénom qui va être porté par des hommes et des femmes ---> limite absence de proportion sur ces prénoms: A quel point sont -ils portés par les hommes et par les femmes

#### Etape 1: Compter le nombre de prénom par année pour chaque genre

In [45]:
data %>% filter(genre =="H") %>% group_by(prénom, genre) %>% summarise(somme = sum(naissance)) %>% arrange(desc(somme)) %>% head()

`summarise()` has grouped output by 'prénom'. You can override using the `.groups` argument.

  prénom         genre somme
1 Jean           H     1914060
2 Pierre         H      891611
3 Michel         H      820353
4 _Prenoms_rares H      799188
5 André          H      711950
6 Philippe       H      538519

In [46]:
data %>% filter(genre =="H") %>% group_by(prénom,genre) %>% summarise(somme = sum(naissance), na.rm = TRUE) %>% arrange(desc(somme)) %>% head()

`summarise()` has grouped output by 'prénom'. You can override using the `.groups` argument.

  prénom         genre somme   na.rm
1 Jean           H     1914060 TRUE
2 Pierre         H      891611 TRUE
3 Michel         H      820353 TRUE
4 _Prenoms_rares H      799188 TRUE
5 André          H      711950 TRUE
6 Philippe       H      538519 TRUE

In [47]:
data %>% filter(genre =="F") %>% group_by(prénom, genre) %>% summarise(somme = sum(naissance), na.rm = TRUE) %>% arrange(desc(somme)) -> prenom_f

#### Présence de Marie dans prénom_f ?
prenom_f %>% filter(prénom =="Marie")

`summarise()` has grouped output by 'prénom'. You can override using the `.groups` argument.

  prénom genre somme   na.rm
1 Marie  F     2232238 TRUE

In [54]:
prenom_H <- data %>% filter(genre =="H") %>% group_by(prénom) %>% summarise(somme = sum(naissance), na.rm = TRUE) %>% arrange(desc(somme)) 
head(prenom_H)

  prénom         somme   na.rm
1 Jean           1914060 TRUE
2 Pierre          891611 TRUE
3 Michel          820353 TRUE
4 _Prenoms_rares  799188 TRUE
5 André           711950 TRUE
6 Philippe        538519 TRUE

In [55]:
prenom_F <- data %>% filter(genre =="F") %>% group_by(prénom) %>% summarise(somme = sum(naissance), na.rm = TRUE) %>% arrange(desc(somme))
head(prenom_F)

  prénom         somme   na.rm
1 Marie          2232238 TRUE
2 _Prenoms_rares  854078 TRUE
3 Jeanne          559349 TRUE
4 Françoise       401487 TRUE
5 Monique         399762 TRUE
6 Catherine       394674 TRUE

#### Etape 2: Joindre les deux tables

https://dplyr.tidyverse.org/reference/mutate-joins.html?q=join%20inner

![image.png](attachment:image.png)

In [56]:
prenom_H %>% filter(prénom =="Kim")

  prénom somme na.rm
1 Kim    1231  TRUE

In [58]:
join_prenoms  <- inner_join(prenom_F, prenom_H, by = "prénom") 
head(join_prenoms)

  prénom         somme.x na.rm.x somme.y na.rm.y
1 Marie          2232238 TRUE     26897  TRUE
2 _Prenoms_rares  854078 TRUE    799188  TRUE
3 Jeanne          559349 TRUE        88  TRUE
4 Françoise       401487 TRUE        34  TRUE
5 Monique         399762 TRUE       440  TRUE
6 Catherine       394674 TRUE       229  TRUE

In [61]:
rename(join, nb_femme = somme.x, nb_homme = somme.y ) %>% select(prénom, nb_femme, nb_homme) -> prenom_mixte

prenom_mixte %>% head()

  prénom         nb_femme nb_homme
1 Marie          2232238   26897
2 _Prenoms_rares  854078  799188
3 Jeanne          559349      88
4 Françoise       401487      34
5 Monique         399762     440
6 Catherine       394674     229

#### Etape 3: Calculer le ratio

In [62]:
prenom_mixte %>% mutate(ratio = nb_femme/nb_homme) %>% head()

  prénom         nb_femme nb_homme ratio
1 Marie          2232238   26897      82.992081
2 _Prenoms_rares  854078  799188       1.068682
3 Jeanne          559349      88    6356.238636
4 Françoise       401487      34   11808.441176
5 Monique         399762     440     908.550000
6 Catherine       394674     229    1723.467249

In [68]:
ratio <- prenom_mixte %>% mutate(ratio = nb_femme/nb_homme) %>% arrange(desc(nb_homme))
head(ratio)

  prénom         nb_femme nb_homme ratio
1 Jean              546   1914060  0.0002852575
2 Pierre            920    891611  0.0010318401
3 Michel            181    820353  0.0002206367
4 _Prenoms_rares 854078    799188  1.0686822124
5 André             628    711950  0.0008820844
6 Philippe          287    538519  0.0005329431

A/B : Premiere approche
A/ (A +B)

In [84]:
data_h_f  <- prenom_mixte %>% mutate(ratio = nb_femme/(nb_homme + nb_femme ))
head(data_h_f)

  prénom         nb_femme nb_homme ratio
1 Marie          2232238   26897   0.9880941
2 _Prenoms_rares  854078  799188   0.5166005
3 Jeanne          559349      88   0.9998427
4 Françoise       401487      34   0.9999153
5 Monique         399762     440   0.9989006
6 Catherine       394674     229   0.9994201

In [75]:
inner_join(prenom_F, prenom_H, by = "prénom") %>% select(prénom, somme.x, somme.y) %>% mutate(ratio =somme.x/somme.y) %>% head()

  prénom         somme.x somme.y ratio
1 Marie          2232238  26897     82.992081
2 _Prenoms_rares  854078 799188      1.068682
3 Jeanne          559349     88   6356.238636
4 Françoise       401487     34  11808.441176
5 Monique         399762    440    908.550000
6 Catherine       394674    229   1723.467249

In [79]:
dataHF <- inner_join(prenom_F, prenom_H, by = "prénom") %>% select(prénom, somme.x, somme.y) %>% mutate(ratio =somme.x/somme.y)
head(dataHF)

  prénom         somme.x somme.y ratio
1 Marie          2232238  26897     82.992081
2 _Prenoms_rares  854078 799188      1.068682
3 Jeanne          559349     88   6356.238636
4 Françoise       401487     34  11808.441176
5 Monique         399762    440    908.550000
6 Catherine       394674    229   1723.467249

#### Etape 4: Filtrer

In [90]:
data_h_f %>% filter(ratio > 0.97) %>% head(5)

  prénom    nb_femme nb_homme ratio
1 Marie     2232238  26897    0.9880941
2 Jeanne     559349     88    0.9998427
3 Françoise  401487     34    0.9999153
4 Monique    399762    440    0.9989006
5 Catherine  394674    229    0.9994201

In [95]:
dataHF %>% filter((ratio > 0.85) & (ratio < 1.15 )) %>% head(10) #%>% select(prénom)

   prénom         somme.x somme.y ratio
1  _Prenoms_rares 854078  799188  1.0686822
2  Charlie         11846   13086  0.9052422
3  Yael             3002    3080  0.9746753
4  Gaby             2327    2089  1.1139301
5  Yaël             1344    1571  0.8555060
6  Mady             1046     972  1.0761317
7  Rosario           782     755  1.0357616
8  Medine            627     630  0.9952381
9  Paris             343     299  1.1471572
10 Milane            285     301  0.9468439